{
    "mainPage": {
        "home": "Home",
        "cv": "Curriculum Vitae",
        "skills": "Skills",
        "programmingArea": "Programming Area",
        "contact": "Contact"
    },
    "curriculumPage": {
        "personalData": "Personal Data",
        "profile": "Technical Profile",
        "education": "Education",
        "languages": "Languages",
        "softwareTools": "Software Tools",
        "workExperience": "Work Experience",
        "trainingCourses": "Training Courses",
        "certifications": "Certifications",
        "publications": "Publications",
        "personalDataSection": {
            "name": "Name:",
            "address": "Address:",
            "city": "City:",
            "phone": "Phone Number:",
            "birthdate": "Birthdate:",
            "postalCode": "Postal Code:",
            "age": "Age:",
            "email": "Email:"
        },
        "profileSection": {
            "content": [
                "After joining Deloitte in March (2016), I have attended three courses related to the following competences: SAP (ABAP modality), Java and Salesforce.<br><br>",
                "During my work experience, I have been involved in several maintenance and development Salesforce projects where I could grow up as code developer and platform admin.<br><br>",
                "In June of 2016, I was involved in a project for energy market. In there, we developed an aplication to help salesforce to create cases in emergency peaks.This app was developed in Java, Spring, Hibernate and published in Heroku, with Postgres and HerokuConnect(tool to connect SFDC and fill the data in Postgres).<br><br>",
                "Thanks to this project and my work team, I could learn and explore the set of tools that a Java Web application offer as: HTML,CSS,jQuery, JSP, Javascript, SQL, REST, AJAX..., the study of the Heroku platform and its synchronization with Salesforce and the use of Talend tool for massive data migration (ETL).<br><br>",
                "In October of 2017, I was in charge of the development and publishment in Heroku of a NodeJS Web service app which purpose was massive user data sending to a SMS sending data Company and recovery and storage of responses received in PostgresSQL.<br><br>",
                "This was the first time I carried out a project on my own, and it became an important challenge due to my lack of knowledge about this particular technology. However, my previous experience in Java and constant search for information helped me to learn more about NodeJS, thus gaining experience about asynchronous development methods and creation of REST services.<br><br>",
                "In March of 2018, I started a new professional adventure as senior developer in IA SOFT company, being my first project an environmental quality and waste management application in Angular 6 and Java (JPA).<br><br>",
                "In June of 2018 the company sent me to work as external professional in the Seminario of Zaragoza in order to take the responsability of the civil service application (Java Server Faces) and carry out some new modules and functionalities on it."
            ]
        },
        "educationSection": {
            "degree": "Degree:",
            "university": "Bachelor Degree in Mathematics by University of Zaragoza (Sept 2011 – Feb 2016)."
        },
        "languageSection": {
            "spanish": "Spanish:",
            "spanish_s1": "Mother tongue.",
            "english": "English:",
            "english_s1": "Demonstrable speaking and writting upper-intermediate level. ",
            "english_s2": "Experience and daily english calls in international projects and as auto-formation."
        },
        "softwareToolsSection": {
            "java": "Java:",
            "salesforce": "Salesforce:",
            "angular": "Angular:",
            "nodejs": "NodeJS:",
            "webDesign": "Web Design:",
            "webServices": "Web Services:",
            "bbdd": "BBDD:",
            "etl": "ETL:",
            "codeEditor": "Code Editor:",
            "versionControl": "Version Control:",
            "continuousIntegration": "Continuous Integration:"
        },
        "workExperienceSection": {},
        "trainingCoursesSection": {
            "courses": "Courses:",
            "course_1": "Java Formation Course (April 2016).",
            "course_2": "Salesforce Formation Course (April 2016).",
            "course_3": "SAP Formation Course, AVAP Modality (March 2016). ",
            "course_4": "Angular 6 Formation Course (Abril 2018).",
            "presentations": "Presentations:",
            "presentation_1": "Salesforce Course Instructor (October 2016).",
            "presentation_2": "Java Course Instructor (October 2017)."
        },
        "certificationsSection": {
            "oracleCert": "Java Standard Edition 6 Programmer Certified Professional (Score: 93%)"
        },
        "publicationsSection": {
            "tfg": "Ecuaciones Diferenciales Implícitas y Clasificación de sus Singularidades"
        }
    }
}