{
    "mainPage": {
        "home": "Inicio",
        "cv": "Curriculum Vitae",
        "skills": "Habilidades",
        "programmingArea": "Espacio de Programación",
        "contact": "Contacto"
    },
    "curriculumPage": {
        "personalData": "Datos Personales",
        "profile": "Perfil técnico",
        "education": "Educación",
        "languages": "Idiomas",
        "softwareTools": "Conocimientos Informáticos",
        "workExperience": "Experiencia Profesional",
        "trainingCourses": "Cursos de Formación",
        "certifications": "Certificaciones",
        "publications": "Publicaciones",
        "personalDataSection": {
            "name": "Nombre y Apellidos:",
            "address": "Dirección:",
            "city": "Localidad:",
            "phone": "Teléfono:",
            "birthdate": "Fecha de nacimiento:",
            "postalCode": "C.P:",
            "age": "Edad:",
            "email": "Correo Electrónico:"
        },
        "profileSection": {
            "content": [
                "Tras iniciarme en el mundo de la programación en Marzo del 2016 he asistido a tres cursos de formación de las competencias SAP (modalidad ABAP), Java y Salesforce.<br><br>",
                "Durante mis dos años de experiencia, he estado envuelto en diversos proyectos de mantenimiento y desarrollo en Salesforce en los cuales he podido formarme tanto a nivel de desarrollador de codigo como de administrador de la plataforma.<br><br>",
                "En Junio de 2016   formé parte de un proyecto de energía focalizado en la creación de una aplicación Java  Web que replicase ciertas funcionalidades de Salesforce como la creación de casos de emergencias. La aplicación fue desarrollada en Java,Spring MVC,Hibernate y publicada en la plataforma Heroku junto con la ayuda de PostgresSQL y HerokuConnect (herramienta encargada de volcar la BBDD de Salesforce en el Postgres de Heroku).<br><br> ",
                "Gracias a este proyecto y al equipo que me rodeaba pude aprender y navegar por el abanico de herramientas que ofrece el diseño de una aplicación Java Web tales como: HTML,CSS,jQuery, JSP, Javascript, SQL, REST, AJAX...,el estudio de la plataforma Heroku y su sincronización con Salesforce y el manejo de la herramienta Talend para la migración masiva de datos (ETL).<br><br>",
                "En Octubre del 2017, estuve a cargo del desarrollo y publicación en Heroku de un servicio web en una aplicación NodeJS cuya finalidad era el envío masivo de datos de usuarios a una companía de envío de SMS´es así como la recuperación y almacenamiento de las respuestas en PostgresSQL. <br><br>",
                "Este fue mi primer proyecto en solitario el cual supuso un reto muy importante para mí debido al desconocimiento de la tecnología, sin embargo mi experiencia anterior en Java y la búsqueda constante de información me sirvió para aprender cada día un poco más de NodeJS y así adquirir experiencia en el desarrollo de funciones asíncronas y creación de servicios REST.<br><br>",
                "En Marzo de 2018, inicié una nueva aventura profesional como programador senior en la empresa IA SOFT en Zaragoza, siendo mi primer proyecto en la empresa una aplicación de gestión de calidad ambiental y de residuos en Angular 6 y Java (JPA) . <br><br>",
                "En Junio de 2018 la empresa me destinó a trabajar como externo en el Seminario de Zaragoza para responsabilizarme de la aplicación de personal del funcionariado de Zaragoza (Java Server Faces) y llevar a cabo una serie de nuevos módulos y funcionalidades."
            ]
        },
        "educationSection": {
            "degree": "Titulación:",
            "university": "Graduado en Matemáticas por la Universidad de Zaragoza (Sept 2011 – Feb 2016)."
        },
        "languageSection": {
            "spanish": "Español:",
            "spanish_s1": "Lengua materna.",
            "english": "Inglés:",
            "english_s1": "Nivel upper-intermediate demostrable en speaking y writting.",
            "english_s2": "Experiencia y calls diarias en inglés en proyectos internacionales y como auto formación."
        },
        "softwareToolsSection": {
            "java": "Java:",
            "salesforce": "Salesforce:",
            "angular": "Angular:",
            "nodejs": "NodeJS:",
            "webDesign": "Diseño Páginas Web:",
            "webServices": "Web Services:",
            "bbdd": "BBDD:",
            "etl": "ETL:",
            "codeEditor": "Editores de Código:",
            "versionControl": "Control de Versiones:",
            "continuousIntegration": "Integración Continua:"
        },
        "workExperienceSection": {},
        "trainingCoursesSection": {
            "courses": "Cursos:",
            "course_1": "Curso de formación de Java (Abril 2016).",
            "course_2": "Curso de formación de Salesforce (Abril 2016).",
            "course_3": "Curso de formacion de SAP modalidad AVAP (Marzo 2016).",
            "course_4": "Curso de formacion de Angular 6 (Abril 2018).",
            "presentations": "Presentaciones:",
            "presentation_1": "Instructor curso de Salesforce (Oct 2016).",
            "presentation_2": "Instructor curso de Java (Oct 2017)."
        },
        "certificationsSection": {
            "oracleCert": "Java Standard Edition 6 Programmer Certified Professional (Score: 93%)"
        },
        "publicationsSection": {
            "tfg": "Ecuaciones Diferenciales Implícitas y Clasificación de sus Singularidades."
        }
    }
}